In [10]:
import pandas as pd

a = pd.DataFrame({"city":["Nashik","Pune","Ahmednagar"],"temperature":[30,40,45],"humidity":[40,50,45]})

In [11]:
a

         city  temperature  humidity
0      Nashik           30        40
1        Pune           40        50
2  Ahmednagar           45        45

In [24]:
b = pd.DataFrame({"city":["Sindhudurg","Raigad","Kolhapur"],"temperature":[45,40,40],"humidity":[70,40,50]})
b

         city  temperature  humidity
0  Sindhudurg           45        70
1      Raigad           40        40
2    Kolhapur           40        50

In [25]:
df = pd.concat([a,b], ignore_index=True,axis=0)
df

         city  temperature  humidity
0      Nashik           30        40
1        Pune           40        50
2  Ahmednagar           45        45
3  Sindhudurg           45        70
4      Raigad           40        40
5    Kolhapur           40        50